## Student Data Analysis

In this activity, you will use the steps below to analyze a dataset of student test scores from schools in a fake school district.

1. Collect the data.

2. Prepare the data.

3. Summarize the data. 

4. Drill down into the data. 

5. Make comparisons.

### Import required libraries and dependencies

<!-- https://pypi.org/project/pathlib2/ -->

In [1]:
import pandas as pd
import os

import warnings
warnings.filterwarnings('ignore')

## Step 1: Collect the data.

To collect the data that you’ll need, complete the following steps:

**1. Using the Pandas `read_csv` function and the `os.path.join` function, import the data from the `new_student_data.csv` file, and create a DataFrame called student_df.**

In [2]:
full_student_data = os.path.join('..','Resources','new_full_student_data.csv')
student_df = pd.read_csv(full_student_data)

**2. Use the head (and/or the tail) function to confirm that Pandas properly imported the data.**

In [3]:
student_df.head()

,student_id,student_name,grade,school_name,reading_score,math_score,school_type,school_budget
0,103880842,Travis Martin,9th,Sullivan High School,59.0,88.2,Public,961125
1,45069750,Michael Brown,9th,Dixon High School,94.7,73.5,Charter,870334
2,45024902,Gabriela Lucero,9th,Wagner High School,89.0,70.4,Public,846745
3,62582498,Susan Richardson,9th,Silva High School,69.7,80.3,Public,991918
4,16437227,Sherry Davis,11th,Bowers High School,NaN,27.5,Public,848324

## Good work!

You are now prepared to start the next lesson before starting step 2.

## Deliverable 2

Prepare the data

In [4]:
# Check for rows that have (NaN) values, and remove these rows.
student_df.isna().sum()

student_id          0
student_name        0
grade               0
school_name         0
reading_score    1968
math_score        982
school_type         0
school_budget       0
dtype: int64

In [5]:
student_df.isna().mean()

student_id       0.000000
student_name     0.000000
grade            0.000000
school_name      0.000000
reading_score    0.100851
math_score       0.050323
school_type      0.000000
school_budget    0.000000
dtype: float64

In [6]:
student_df = student_df.dropna()
student_df.isna().sum()

student_id       0
student_name     0
grade            0
school_name      0
reading_score    0
math_score       0
school_type      0
school_budget    0
dtype: int64

In [7]:
#Check for duplicate rows and remove them.
student_df.duplicated().sum()

1836

In [8]:
student_df = student_df.drop_duplicates()
student_df.duplicated().sum()

0

In [9]:
#Check the data types of the columns by using dtypes property.
student_df.dtypes

student_id         int64
student_name      object
grade             object
school_name       object
reading_score    float64
math_score       float64
school_type       object
school_budget      int64
dtype: object

In [10]:
#Remove the "th" suffix from every value by using the str and replace.
student_df['grade'] = student_df['grade'].str.replace('th','')
student_df['grade']

0         9
1         9
2         9
3         9
5         9
         ..
19508    10
19509    12
19511    11
19512    11
19513    12
Name: grade, Length: 14831, dtype: object

In [11]:
#Change the "grade" column to the int type and verify the column types.
student_df['grade'] = student_df['grade'].astype(int)
student_df.dtypes

student_id         int64
student_name      object
grade              int32
school_name       object
reading_score    float64
math_score       float64
school_type       object
school_budget      int64
dtype: object

## Deliverable 3

Summarize the data

In [12]:
#Generate the summary statistics for the student DataFrame by using the describe function.
student_df.describe()

         student_id         grade  reading_score    math_score  school_budget
count  1.483100e+04  14831.000000   14831.000000  14831.000000   14831.000000
mean   6.975296e+07     10.355539      72.357865     64.675733  893742.749107
std    3.452909e+07      1.097728      15.224590     15.844093   53938.066467
min    1.000906e+07      9.000000      10.500000      3.700000  817615.000000
25%    3.984433e+07      9.000000      62.200000     54.500000  846745.000000
50%    6.965978e+07     10.000000      73.800000     65.300000  893368.000000
75%    9.927449e+07     11.000000      84.000000     76.000000  956438.000000
max    1.299997e+08     12.000000     100.000000    100.000000  991918.000000

In [13]:
#Display the mean math score by using the mean function
student_df['math_score'].mean()

64.67573326141189

In [14]:
#Store the minimum reading score in min_reading_score.
min_reading_score = student_df['reading_score'].min()
min_reading_score

10.5

## Deliverable 4

Drill Down into the Data

In [15]:
#Display the grade column by using loc
student_df.loc[0:,["grade"]]

       grade
0          9
1          9
2          9
3          9
5          9
...      ...
19508     10
19509     12
19511     11
19512     11
19513     12

[14831 rows x 1 columns]

In [16]:
#Display the first 3 rows of Columns 3, 4 and 5 using iloc 
student_df.iloc[0:3,3:6]

            school_name  reading_score  math_score
0  Sullivan High School           59.0        88.2
1     Dixon High School           94.7        73.5
2    Wagner High School           89.0        70.4

In [17]:
# Select the rows for Grade 9, and display their summary stats by using loc and describe
student_df.loc[student_df["grade"] == 9].describe()

         student_id   grade  reading_score   math_score  school_budget
count  4.132000e+03  4132.0    4132.000000  4132.000000    4132.000000
mean   6.979441e+07     9.0      69.236713    66.585624  898692.606002
std    3.470565e+07     0.0      15.277354    16.661533   54891.596611
min    1.000906e+07     9.0      17.900000     5.300000  817615.000000
25%    3.953848e+07     9.0      59.000000    56.000000  846745.000000
50%    6.984037e+07     9.0      70.050000    67.800000  893368.000000
75%    9.939504e+07     9.0      80.500000    78.500000  957299.000000
max    1.299997e+08     9.0      99.900000   100.000000  991918.000000

In [18]:
#Store the row with the minimum overall reading score in min_reading_row by using loc and the min_reading_score variable from Deliverable 3
min_reading_row = student_df.loc[student_df["reading_score"] == min_reading_score]
min_reading_row

,student_id,student_name,grade,school_name,reading_score,math_score,school_type,school_budget
3706,81758630,Matthew Thomas,10,Dixon High School,10.5,58.4,Charter,870334

In [19]:
#Select all the reading scores from 10th graders at Dixon HS by using loc with conditionals
student_df.loc[(student_df["grade"]==10)&(student_df["school_name"]=="Dixon High School"),["school_name","reading_score"]]

             school_name  reading_score
45     Dixon High School           71.1
60     Dixon High School           59.5
69     Dixon High School           88.6
94     Dixon High School           81.5
100    Dixon High School           95.3
...                  ...            ...
19283  Dixon High School           52.9
19306  Dixon High School           58.0
19344  Dixon High School           38.0
19368  Dixon High School           84.4
19445  Dixon High School           43.9

[569 rows x 2 columns]

In [20]:
#Find the mean reading score for all the students in Grade 11 and 12 combined by using conditional statements loc or iloc
student_df.loc[student_df["grade"]>=11 , "reading_score"].mean()

74.90038089192188

## Deliverable 5

Compare the data

In [37]:
#Display the average budget for each school type by using the groupby and mean functions.
avg_budget_by_school_type = student_df[['school_type','school_budget']].groupby(by='school_type', as_index=True).mean()
avg_budget_by_school_type

             school_budget
school_type
Charter      872625.656236
Public       911195.558251

In [61]:
#Find the total number of students at each school, and sort those numbers from largest to smallest by using the groupby, count, and sort_values functions.
total_students = student_df.groupby(by='school_name').count()
total_students.loc[:, ["student_id"]].sort_values(by='student_id', ascending=False)

                        student_id
school_name
Montgomery High School        2038
Green High School             1961
Dixon High School             1583
Wagner High School            1541
Silva High School             1109
Woods High School             1052
Sullivan High School           971
Turner High School             846
Bowers High School             803
Fisher High School             798
Richard High School            551
Campos High School             541
Odonnell High School           459
Campbell High School           407
Chang High School              171

In [62]:
#Find the average math score by grade for each school type by using the groupby and mean functions.
avg_by_school = student_df.groupby(['school_type', 'grade']).mean()
avg_by_school.loc[:, ["math_score"]]

                   math_score
school_type grade
Charter     9       70.077874
            10      66.443206
            11      68.024735
            12      60.212121
Public      9       63.771066
            10      63.764121
            11      59.314337
            12      63.568319